[
  {
    "_id": 1,
    "company": "Paladin Technologies Inc.",
    "designation": "Accounts Payable Specialist",
    "duration": "March 2024 - Present",
    "location": "BC, Canada",
    "responsibilities": [
      "Accurately handled fast-paced large-volume invoices for Paladin Technologies Inc., using Microsoft Dynamics F&O D365 & Sedona. Responsibilities include matching, posting, and processing 50-60 invoices, submitting claims, updating weekly payments, monthly reconciliations, vendor and purchaser 30-40 communication every business day.",
      "Ensure timely payments and maintain strong vendor and supplier relationships. Apply accurate coding to invoices, files, and receipts for organized records, and proactively verify information and resolve client discrepancies."
    ],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/paladin/paladin-logo.jpg",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/paladin/paladin-banner.jpg",
    "companyWebLink": "https://paladintechnologies.com/",
    "showInHome": true,
    "showInExperiencePage": true,
    "paragraphOne": "With decades of experience and offices spanning coast to coast, Paladin Technologies has firmly established itself as North America’s premier complex systems integrator. Paladin excels in designing and deploying advanced integrated systems technology and infrastructure nationwide while delivering exceptional local support. Paladin's solutions encompass integrated security, networking & wireless, structured cabling, audiovisual, alarms & monitoring, and more. In March 2024, I joined Paladin Technologies Inc. at its headquarters in Vancouver, BC, Canada, as an Accounts Payable Specialist. In this capacity, I manage high-volume invoices, leveraging Microsoft Dynamics F&O D365 and Sedona to ensure accuracy and efficiency.My primary responsibilities include:",
    "paragraphTwo": "Ensuring timely payments and fostering robust relationships with vendors and suppliers are central to my role. I am committed to maintaining organized financial records through the precise coding of invoices, files, and receipts. Additionally, I proactively verify information and resolve client discrepancies, contributing to the smooth and efficient operation of our financial processes.",
    "paragraphThree":"Beyond my role at Paladin Technologies, I bring a wealth of experience in accounts payable and administrative coordination from various industries. I have efficiently managed hundreds of invoices at Imperial Distributors Canada Inc., coordinated projects at RosesLife Women Center Foundation, and provided exceptional client service at Tax Puzzle Solution Inc. My diverse background also includes event coordination and community outreach, showcasing my ability to adapt and excel in dynamic environments.",
    "paragraphFour": "I am proficient in a range of software tools, including Microsoft Dynamics, Microsoft Office, Acrobat, Adobe Premiere Pro, CRM, QuickBooks, Sage 50, Photoshop, Illustrator, and Canva. My strong technical skills complement my financial expertise, enabling me to deliver high-quality results consistently.",
    "paragraphFive": "",
    "paragraphSix": "For more information about Paladin Technologies and our innovative solutions, visit Paladin Technologies. To learn more about my professional journey and achievements, visit Quazi Fahim Mohammadullah",

    "paraLists": [ 
      "Efficiently managed and processed 50-70 invoices/day using Microsoft Dynamics D365 F&O.",
      "Accurately matched posts and process invoices, ensuring timely submission and approval of claims.",
      "Conducted three weekly payment runs, ensuring all vendor payments are processed accurately and on time.",
      "Performed monthly invoice reconciliations to verify and validate financial transactions and maintained accurate records.",
      "Executed inventory checks andmatchpurchase receipts withorders,ensuring department alignment.",
      "Adjusted purchase order prices as necessary, maintaining effective communication across departments."
      
    ],
    "paraImageOne": "https://media.licdn.com/dms/image/v2/D5622AQG_qyLgmpGTZw/feedshare-shrink_1280/feedshare-shrink_1280/0/1718690615982?e=1738800000&v=beta&t=-7C5RzwXIYe0UAobIQQ-EkTdkBtvAACi9wdodOGi5rM",
    "paraImageOneCaption": "“Team Paladin Technologies had a great time at the BC Lions match! A fantastic evening of fun and team spirit across all departments from Headquarter.”",
    "paraImageTwo": "https://media.licdn.com/dms/image/v2/D5622AQFDWDR_10lo1w/feedshare-shrink_2048_1536/B56ZPBweZfG8Ao-/0/1734122534450?e=1738800000&v=beta&t=bsljU3JYD-iRvioErGZQpnBSS1-SmsJmrBwlsKNWmkU",
    "paraImgeTwoCaption": "Holiday party with the whole team of HQ",
    "paraImageThree": "https://media.licdn.com/dms/image/v2/D5622AQEhC4AP0xaQeQ/feedshare-shrink_1280/feedshare-shrink_1280/0/1733262586780?e=1738800000&v=beta&t=DpFro6qVKPA7aF6KRCvzuNJm9LVQnoSdkjUR2fNqJxU",
    "paraImageThreeCaption": "Festive vibes and sweet treats.Team AP HQ, Paladin Technologies."  
  },
  {
    "_id": 2,
    "company": "Imperial Distributors Canada Inc.",
    "designation": "Accounts Payable",
    "duration": "October 2023 – March 2024",
    "location": "BC, Canada",
    "responsibilities": [
      "Efficiently managed hundreds of invoices for Imperial Distributors Canada Inc., a Jim Pattison Food Group subsidiary, using Microsoft Dynamics Business Centre.",
      "Responsibilities include matching, posting, and processing invoices, submitting claims, and ensuring smooth financial operations through effective communication. Also handle three weekly payments, monthly invoice reconciliations, inventory checks, purchase receipt matching, and purchase order price adjustments within and across departments."
    ],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/imperial/imperial-logo.png",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/imperial/imperial-banner.jpg",
    "companyWebLink": "https://idci.ca/",
    "showInHome": true,
    "showInExperiencePage": true,
    "paragraphOne": "Imperial Distributors Canada Inc. (IDCI), a subsidiary of the Jim Pattison Food Group, is a leading pharmaceutical distribution company distributing healthcare products, including RX, OTC, and generic brands, across the West Coast of Canada. Renowned for its personal service and strong vendor relationships, IDCI excels in delivering impeccable service within the industry. Since October 2023, I have been a dedicated member of IDCI’s Accounts Payable team. My role involves managing hundreds of invoices using Microsoft Dynamics Business Central NAV, ensuring precision and efficiency. My key responsibilities include:",
    "paragraphTwo": "My professional journey extends far beyond IDCI, showcasing a wealth of experience in accounts payable and administrative coordination across a variety of industries. At Imperial Distributors Canada Inc., I adeptly managed invoices, while at RosesLife Women Center Foundation, I skillfully coordinated projects. Additionally, I delivered exceptional client service at Tax Puzzle Solution Inc. My diverse expertise also includes event coordination and community outreach, highlighting my adaptability and excellence in dynamic, fast-paced environments. With a proven track record of success, I am confident in my ability to contribute effectively to any organization.",
    "paragraphThree": "Working at IDCI’s fast-paced environment, which consistently achieves record-breaking revenues, I contribute to a company that values innovation, integrity, and community impact. Our commitment to enhancing healthcare delivery ensures a healthier future for the communities we serve.",
    "paragraphFour": "For more information about Imperial Distributors Canada Inc., visit IDCI. To learn more about my professional journey and achievements, visit Quazi Fahim Mohammadullah.",
    "paragraphFive": "",
    "paragraphSix": "",
    "paraLists": [
      "Processed supplier invoices in compliance with established company policies and procedures using MS D365 NAV.",
      "Verified invoice accuracy for data such as pricing, quantities and freight charges etc.",
      "Secured urgent approvals for invoice payments.",
      "Maintained accurate and up-to-date accounts payable records within the system.",
      "Communicated effectively with vendors to resolve discrepancies and ensure positive relationships.",
      "Reconciled vendor statements monthly and ensured timely payments."
    ],
    "paraImageOne": "",
    "paraImageOneCaption": "",
    "paraImageTwo": "",
    "paraImgeTwoCaption": ""
  },
  {
    "_id": 3,
    "company": "RosesLife Women Center Foundation",
    "designation": "Program Coordinator",
    "duration": "June –July 2023 (Contract Project)",
    "location": "BC, Canada",
    "responsibilities": [
      "Coordinating for a women and racism-focused not-for-profit organization, overseeing book publishing with a focus on professional writing. Managed cover design and final error review to ensure high-quality publications.",
      "Responsible for managing social media and blog posts, ensuring engaging content and effective communication of the organization's mission. Collaborates closely with the Executive Director to drive strategic initiatives and achieve organizational goals."
    ],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/Roses%20Life%20Women%20Center%20Foundation/main.png",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/Roses%20Life%20Women%20Center%20Foundation/roselife-banner.jpg",
    "companyWebLink": "https://rlwomencenter.org/",
    "showInHome": true,
    "showInExperiencePage": true,
    "paragraphOne": "The RosesLife Women Center Foundation is a comprehensive support organization dedicated to uplifting women, especially those identified as visible minorities. Its mission encompasses physical, mental, emotional, spiritual, and social well-being, aiming to eliminate inequality and discrimination. The foundation empowers women to thrive and achieve their full potential. During my contract project at the foundation, I led several initiatives, including the publication of books on women empowerment via Amazon Publishing. I managed social media and blog posts to raise awareness about mental health and support elderly people. By overseeing cover design and conducting final error reviews, I ensured high-quality publications that attract younger audiences. Collaborating closely with the Executive Director, I contributed to strategic initiatives that furthered the organization's goals. My responsibilities included:",
    "paragraphTwo": "As a Program Coordinator, I helped the organization to present its views through several impactful blog posts aimed at empowering women and raising awareness about mental health. These posts covered topics such as managing stress, overcoming self-doubt, promoting holistic well-being for seniors, and combating racism. Each article was carefully crafted to engage the audience, provide valuable insights, and support the foundation's mission of uplifting women from all backgrounds. You can explore these blog posts <Link to='https://rlwomencenter.org/our-blog/'>here</Link>.",
    "paragraphThree": "My professional journey has been diverse and rewarding, particularly during my time at RLWCF. I've garnered extensive experience in program coordination and administrative management across Non-profit’s. At RLWCF, managing multiple programs was not just a task; it was a fulfilling opportunity to showcase my efficiency and dedication. One project, in particular, stands out to me—the book publishing initiative. It was more than just a project; it was a chance to make a meaningful contribution to my community, especially to minority groups. Being involved in promoting social media for RLWCF was another aspect I found gratifying. It allowed me to engage with and advocate for underrepresented voices. Through these experiences, I learned and grew personally and professionally. With a proven track record of success, I am confident in my ability to contribute effectively to any organization, fostering continued growth and success.",
    "paragraphFour": "",
    "paragraphFive": "",
    "paragraphSix": "For more information about the foundation, visit RosesLife Women Center. To learn more about my professional background, visit Quazi Fahim Mohammadullah.",
    "paraLists": [
      "Coordinating book publishing projects with a focus on professional writing, ensuring meticulous cover design and final error reviews.",
      "Managing social media and blog content to effectively communicate the organization's mission and engage the community.",
      "Driving strategic initiatives to achieve organizational goals and promote women's empowerment."
    ],
    "paraImageOne": "https://www.qfahim.com/assets/media/experiences/Roses%20Life%20Women%20Center%20Foundation/1.jpg",
    "paraImageOneCaption": "",
    "paraImageTwo": "https://photos.fife.usercontent.google.com/pw/AP1GczP7Q6A-4GeFBRHt9IbntiFA6ssXmYxPZuD6U8PXzbFs_W5I8sEeOjpI6A=w511-h718-s-no-gm?authuser=0,https://photos.fife.usercontent.google.com/pw/AP1GczPasrC0RTRpuy00zqSPRC8HDtbJkJjPwBt4b1LFmLdJKdNhcdRWig2kEQ=w518-h720-s-no-gm?authuser=0,https://photos.fife.usercontent.google.com/pw/AP1GczOnJb3Wn0wmPujZuompy6sR64eeymsRgjIDP20lV54kySn99Wn3D1MQ6g=w511-h708-s-no-gm?authuser=0",
    "paraImgeTwoCaption": "Some of the Book Covers Design I made and Coordinated:"
  },
  {
    "_id": 4,
    "company": "Tax Puzzle Solution Inc.",
    "designation": "Accounts Receivable | Administrative Coordinator | Finance",
    "duration": "September 2022 - October 2023",
    "location": "BC, Canada",
    "responsibilities": [
      "Provided customer service by assisting clients with inquiries, scheduling appointments, and managing client databases to ensure accurate and up-to-date information. For a recently established tax firm.",
      "Organized client files, including tax records and financial statements, ensuring confidentiality. Coordinated with executives, schedules, meetings, deadlines, and meeting minutes."
    ],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/Tax%20Puzzle%20Solutions/logo.png",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/Tax%20Puzzle%20Solutions/tax-puzzle-banner.jpg",
    "companyWebLink": "https://www.taxpuzzlesolution.com/",
    "showInHome": true,
    "showInExperiencePage": true,
    "paragraphOne": "Tax Puzzle Solution is a newly founded, dynamic, and comprehensive tax and accounting firm, offering a spectrum of services tailored to cater to the diverse needs of individuals and businesses alike. With expertise in personal income tax, income statement preparation, corporate income tax filing, consulting, and bookkeeping, the firm endeavors to furnish thorough and personalized solutions to its clients.TPS’s mission is to simplify the complexities of taxation and accounting, ensuring its clients financial health and compliance. During my time at Tax Puzzle Solution Inc., I held two roles as an Accounts Receivable and Administrative Coordinator. In my role as an Accounts Receivable, I processed invoices, validated expenses, and ensured proper authorization and journal entry. I generated invoices for services and prepared regular financial reports summarizing accounts receivable tasks using QuickBooks. My meticulous attention to detail and commitment to accuracy ensured seamless financial operations. As an Administrative Coordinator, I scheduled appointments and managed 10 to 15 effective client communications daily. I provided exceptional customer service by assisting clients with inquiries, scheduling appointments, and managing client databases to ensure accurate and up-to-date information. Additionally, I organized client files, including tax records and financial statements, ensuring confidentiality. My responsibilities included:",
    "paragraphTwo": "",
    "paragraphThree": "",
    "paragraphFour": "",
    "paragraphFive": "",
    "paragraphSix": "My experience at Tax Puzzle Solution allowed me to develop a strong foundation in both accounting and administrative management. By balancing these dual roles, I demonstrated my ability to manage multiple tasks efficiently and contribute to the firm's growth and success.",
    "paraLists": [
      "Effectively managed communications for 10 –15 clients/day, increasingclientsatisfaction and retention.",
      "Produced invoices and managed client collection duties using QuickBooks.",
      "Handled daily client communications,scheduled appointments, and promptly responded to client inquiries with professionalism."
    ],
    "paraImageOne": "",
    "paraImageOneCaption": "",
    "paraImageTwo": "",
    "paraImgeTwoCaption": ""
  },
  {
    "_id": 5,
    "company": "FRIENDS OF GRANVILLE ISLAND",
    "designation": "Administrative Coordinator | Community Outreach Coordinator",
    "duration": "May 2022 – August 2022",
    "location": "BC, Canada",
    "responsibilities": [
      "Assisted with marketing, social media management, and leading and coordinating a team of 10 for a grassroots community that fosters urban experimentation, innovation, and the nurturing of arts and culture.",
      "Contributed to business plans and grant applications."
    ],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/Friends%20of%20Granville%20Island/main.jpg",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/Friends%20of%20Granville%20Island/grandvile-banner.jpg",
    "companyWebLink": "https://www.friendsofgranvilleisland.com/",
    "showInHome": true,
    "showInExperiencePage": true,
    "paragraphOne": "",
    "paragraphTwo": "Friends of Granville Island (FGI) is a grassroots community that advocates for Granville Island’s unique status as an urban park that is zoned for urban experimentation, innovation, and the nurturing of arts & culture. A rising not-for-profit organization, seeing through fast growth and development and working in multiple sectors of Granville Island.",
    "paragraphThree": "",
    "paragraphFour": "To encourage its full potential as a one-of-a-kind urban public space, FGI’s mission is to help ensure that Granville Island is accessible, equitable, and inclusive for local and global communities, toward creating a community-led ‘People’s Place,’ where urban experimentation, innovation, and arts & culture thrive.",
    "paragraphFive": "",
    "paragraphSix": "I joined FGI as an Administrative Assistant and a Community Outreach Coordinator through Columbia College under a four-month internship contract. Throughout this time, I assisted with marketing, social media management, and leading and coordinating a team of 10 social media assistants, which helped me to improve my leadership skills. I also contributed to business plans and grant applications for fundraisings and government grants. During my employment, FGI proposed an EDI (Equity, Diversity, and Inclusion) committee through collaboration with the General Manager of Granville Island.",
    "paraLists": [],
    "paraImageOne": "",
    "paraImageOneCaption": "",
    "paraImageTwo": "",
    "paraImgeTwoCaption": ""
  },
  {
    "_id": 6,
    "company": "COLUMBIA COLLEGE",
    "designation": "Limitless Event Coordinator",
    "duration": "February 2022 – March 2022 Contract Project",
    "location": "BC, Canada",
    "responsibilities": [
      "Planned, scheduled, and collaborated with 5 different committees, with bi-weekly meetups and generating ideas for an annual student conference.",
      "Worked with logistics & team engagement through promotional videos, poster creation, and managing emails and inquiries"
    ],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/Columbia%20College/main.jpg",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/Columbia%20College/columbia-college-banner.jpg",
    "companyWebLink": "https://www.columbiacollege.ca/limitless_conference",
    "showInHome": true,
    "showInExperiencePage": true,
    "paragraphOne": "Limitless is an annual conference at Columbia College intended to celebrate student excellence in academic scholarship, as well as to equip students with the practical skills and knowledge they need to succeed in life. The conference features keynote speeches from inspiring leaders, a Careers Fair, and the opportunity for attendees to watch their fellow students present on subjects that they are passionate about.",
    "paragraphTwo": "As an ongoing student at Columbia College, I was one of the three students accepted for the position of Limitless Event Coordinator on a two-month contract. I was actively involved in planning, scheduling, and generating ideas for the event and collaborating with 5 different committees through bi-weekly meetups.",
    "paragraphThree": "",
    "paragraphFour": "",
    "paragraphFive": "",
    "paragraphSix": "I helped maintain the social media accounts and through word-of-mouth, videos and poster creation actively promoted the event. I worked with logistics and through team engagement, managed the student emails and inquiries. We concluded the event by receiving feedback from participants and organizers and generating possible ideas for the next conference.",
    "paraLists": [],
    "paraImageOne": "https://www.qfahim.com/assets/media/experiences/Columbia%20College/g-1.jpg",
    "paraImageOneCaption": "Weekly Meeting",
    "paraImageTwo": "",
    "paraImgeTwoCaption": ""
  },
  {
    "_id": 7,
    "company": "Webcoder-IT",
    "designation": "International Client Manager | Accountant",
    "duration": "May 2019 – Aug 2020",
    "location": "Dhaka, Bangladesh",
    "responsibilities": [],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/Webcoder-IT%20Institute/main.jpg",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/Webcoder-IT%20Institute/webcoder-banner.jpg",
    "companyWebLink": "https://www.webcoder-it.com/",
    "showInHome": false,
    "showInExperiencePage": true,
    "paragraphOne": "Webcoder-IT Institute is one of the fastest-growing IT institutions in Bangladesh, providing digital marketing, freelancing, and IT training programs to thousands of students and young professionals throughout the country.",
    "paragraphTwo": "I joined Webcoder-IT as a marketing advisor during the early stages of their initiation, I contributed significantly to the growth of the institute. Under my guidance, the number of monthly applicants increased from less than 30 to more than 150 over the span of a year.",
    "paragraphThree": "Using social media and digital marketing tools such as Social Media Marketing, Google and Facebook Analytics, and Search Engine Optimization, I helped establish their digital presence and spread awareness. I mentored and led their marketing team, introducing necessary changes and upgrading and integrating tools and technologies in line with market trends. We launched monthly outreach programs and educational marketing campaigns to inform students from other institutions about the opportunities in freelancing and online work.",
    "paragraphFour": "In addition to my role as a marketing advisor, I was later appointed as the international client coordinator and accountant. In these capacities, I managed relationships with international clients, ensuring effective communication and satisfaction. I also oversaw the institute's financial operations, maintaining accurate accounts and implementing efficient financial practices.",
    "paragraphFive": "",
    "paragraphSix": "Through these diverse roles, I played a pivotal part in the institute’s expansion and success, leveraging my expertise to drive growth, foster client relations, and ensure financial stability.",
    "paraLists": [
      "Developing and maintaining strong relationships with international clients.",
      "Coordinating projects and ensuring they met client expectations and deadlines.",
      "Addressing client concerns and providing solutions promptly.",
      "Conducting market research to identify potential international markets and clients.",
      "Managing accounts payable and receivable.",
      "Preparing financial statements and reports.",
      "Conducting financial analysis to inform strategic decisions.",
      "Implementing and overseeing budgeting and forecasting processes."
    ],
    "paraImageOne": "",
    "paraImageOneCaption": "",
    "paraImageTwo": "",
    "paraImgeTwoCaption": ""
  },
  {
    "_id": 8,
    "company": "Rahma International SSTS",
    "designation": "Program Organizer",
    "duration": "Mar 2018 – Apr 2019",
    "location": "Dhaka, Bangladesh",
    "responsibilities": [],
    "companyLogo": "https://www.qfahim.com/assets/media/experiences/Rahma%20International%20SSTS/main.jpg",
    "companyBanner": "https://www.qfahim.com/assets/media/experiences/Rahma%20International%20SSTS/rahma-banner.jpg",
    "companyWebLink": "https://sstsbd.org/",
    "showInHome": false,
    "showInExperiencePage": true,
    "paragraphOne": "Rahma International Society is one of Kuwait’s charitable institutions operating in charity and humanitarian fields, to offer its services to the needy inside and outside the State of Kuwait, through developmental, educational, and health projects, targeting orphans, students, refugees, patients, and distressed people affected by wars and natural disasters.",
    "paragraphTwo": "The Society for Social and Technological Support (SSTS) is the Bangladeshi subsidiary of Rahma Int'l Society and receives most of its funds from them. I was recruited as a Program Organizer and was tasked with handling some of their biggest projects, involving 250-1000 people, throughout different regions around the country. During the months of Ramadan, I spearheaded up to 17 consecutive events around 8-9 districts in Bangladesh. I was tasked with budgeting, detailing, receiving feedback and providing written reports.",
    "paragraphThree": "",
    "paragraphFour": "",
    "paragraphFive": "",
    "paragraphSix": "Some of my in-office tasks included following up with new project proposals and through discussions and multiple revisions, make budgets and plans for proper execution and report submission.",
    "paraLists": [],
    "paraImageOne": "",
    "paraImageOneCaption": "",
    "paraImageTwo": "",
    "paraImgeTwoCaption": ""
  }
]
